[
    "G-code words consist of a letter and a value. Letter was not found.",
    "Numeric value format is not valid or missing an expected value.",
    "Grbl '$' system command was not recognized or supported.",
    "Negative value received for an expected positive value.",
    "Homing cycle is not enabled via settings.",
    "Minimum step pulse time must be greater than 3usec",
    "EEPROM read failed. Reset and restored to default values.",
    "Grbl '$' command cannot be used unless Grbl is IDLE. Ensures smooth operation during a job.",
    "G-code locked out during alarm or jog state",
    "Soft limits cannot be enabled without homing also enabled.",
    "Max characters per line exceeded. Line was not processed and executed.",
    "(Compile Option) Grbl '$' setting value exceeds the maximum step rate supported.",
    "Safety door detected as opened and door state initiated.",
    "(Grbl-Mega Only) Build info or startup line exceeded EEPROM line length limit.",
    "Jog target exceeds machine travel. Command ignored.",
    "Jog command with no '=' or contains prohibited g-code.",
    "Laser mode requires PWM output.",
    "Unsupported or invalid g-code command found in block.",
    "More than one g-code command from same modal group found in block.",
    "Feed rate has not yet been set or is undefined.",
    "G-code command in block requires an integer value.",
    "Two G-code commands that both require the use of the XYZ axis words were detected in the block.",
    "A G-code word was repeated in the block.",
    "A G-code command implicitly or explicitly requires XYZ axis words in the block, but none were detected.",
    "N line number value is not within the valid range of 1 - 9,999,999.",
    "A G-code command was sent, but is missing some required P or L value words in the line.",
    "Grbl supports six work coordinate systems G54-G59. G59.1, G59.2, and G59.3 are not supported.",
    "The G53 G-code command requires either a G0 seek or G1 feed motion mode to be active. A different motion was active.",
    "There are unused axis words in the block and G80 motion mode cancel is active.",
    "A G2 or G3 arc was commanded but there are no XYZ axis words in the selected plane to trace the arc.",
    "The motion command has an invalid target. G2, G3, and G38.2 generates this error, if the arc is impossible to generate or if the probe target is the current position.",
    "A G2 or G3 arc, traced with the radius definition, had a mathematical error when computing the arc geometry. Try either breaking up the arc into semi-circles or quadrants, or redefine them with the arc offset definition.",
    "A G2 or G3 arc, traced with the offset definition, is missing the IJK offset word in the selected plane to trace the arc.",
    "There are unused, leftover G-code words that aren't used by any command in the block.",
    "The G43.1 dynamic tool length offset command cannot apply an offset to an axis other than its configured axis. The Grbl default axis is the Z-axis.",
    "Tool number greater than max supported value."
]